loginapi/app/controllers/bookstock_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "bookstocks".* FROM "bookstocks"
---
    def index
        current_user = User.find_by_id(session[:current_user_id])
        if (current_user.nil?)
            render json: "not authenticated user"
        else
        render json: Bookstock.all

SELECT "bookstocks".* FROM "bookstocks" WHERE "bookstocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        v = Bookstock.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "bookstocks" ("bookName", "bookAuthor", "bookQuantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bookName", "Chandamama"], ["bookAuthor", "KK devi"], ["bookQuantity", 5], ["created_at", "2023-01-18 08:23:27.457429"], ["updated_at", "2023-01-18 08:23:27.457429"]]
---
    def create
        current_user = User.find_by_id(session[:current_user_id])
        if (current_user.nil?)
            render json: "not authenticated user"
        else

        v = !params[:bookName].empty? and !params[:bookAuthor].empty?

        if (v)
              p=Bookstock.create(
              'bookName': params[:bookName],
              'bookAuthor': params[:bookAuthor],
              'bookQuantity': params[:bookQuantity]
            )